
## Plan Result

[CI link](https://github.com/marwenbhriz/ga-terraform/actions/runs/9948273065)


<pre><code>Plan: 5 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.cloudsql.google_compute_global_address.private_ip_address
  * module.cloudsql.google_sql_database.database
  * module.cloudsql.google_sql_database_instance.default
  * module.cloudsql.google_sql_user.gauser
  * module.cloudsql.random_id.mysql_gauser_password


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.cloudsql.google_compute_global_address.private_ip_address will be created
  + resource "google_compute_global_address" "private_ip_address" {
      + address            = "191.100.0.0"
      + address_type       = "INTERNAL"
      + creation_timestamp = (known after apply)
      + effective_labels   = (known after apply)
      + id                 = (known after apply)
      + name               = "ga-private-ip-address"
      + network            = "https://www.googleapis.com/compute/v1/projects/grasys-study/global/networks/ga-vpc"
      + prefix_length      = 20
      + project            = "grasys-study"
      + purpose            = "VPC_PEERING"
      + self_link          = (known after apply)
      + terraform_labels   = (known after apply)
    }

  # module.cloudsql.google_sql_database.database will be created
  + resource "google_sql_database" "database" {
      + charset         = "utf8"
      + collation       = "utf8_general_ci"
      + deletion_policy = "DELETE"
      + id              = (known after apply)
      + instance        = "ga-terraform"
      + name            = "tasks"
      + project         = "grasys-study"
      + self_link       = (known after apply)
    }

  # module.cloudsql.google_sql_database_instance.default will be created
  + resource "google_sql_database_instance" "default" {
      + available_maintenance_versions = (known after apply)
      + connection_name                = (known after apply)
      + database_version               = "MYSQL_8_0"
      + deletion_protection            = false
      + dns_name                       = (known after apply)
      + encryption_key_name            = (known after apply)
      + first_ip_address               = (known after apply)
      + id                             = (known after apply)
      + instance_type                  = (known after apply)
      + ip_address                     = (known after apply)
      + maintenance_version            = (known after apply)
      + master_instance_name           = (known after apply)
      + name                           = "ga-terraform"
      + private_ip_address             = (known after apply)
      + project                        = "grasys-study"
      + psc_service_attachment_link    = (known after apply)
      + public_ip_address              = (known after apply)
      + region                         = "asia-northeast1"
      + self_link                      = (known after apply)
      + server_ca_cert                 = (sensitive value)
      + service_account_email_address  = (known after apply)

      + replica_configuration {
          + ca_certificate            = (known after apply)
          + client_certificate        = (known after apply)
          + client_key                = (known after apply)
          + connect_retry_interval    = (known after apply)
          + dump_file_path            = (known after apply)
          + failover_target           = (known after apply)
          + master_heartbeat_period   = (known after apply)
          + password                  = (sensitive value)
          + ssl_cipher                = (known after apply)
          + username                  = (known after apply)
          + verify_server_certificate = (known after apply)
        }

      + settings {
          + activation_policy     = "ALWAYS"
          + availability_type     = "ZONAL"
          + connector_enforcement = (known after apply)
          + disk_autoresize       = true
          + disk_autoresize_limit = 0
          + disk_size             = (known after apply)
          + disk_type             = "PD_SSD"
          + edition               = "ENTERPRISE"
          + pricing_plan          = "PER_USE"
          + tier                  = "db-f1-micro"
          + user_labels           = (known after apply)
          + version               = (known after apply)

          + backup_configuration {
              + binary_log_enabled             = true
              + enabled                        = true
              + location                       = "asia"
              + start_time                     = "00:00"
              + transaction_log_retention_days = 5

              + backup_retention_settings {
                  + retained_backups = 7
                  + retention_unit   = "COUNT"
                }
            }

          + ip_configuration {
              + allocated_ip_range                            = (known after apply)
              + enable_private_path_for_google_cloud_services = (known after apply)
              + ipv4_enabled                                  = (known after apply)
              + private_network                               = (known after apply)
              + require_ssl                                   = (known after apply)
              + ssl_mode                                      = (known after apply)

              + authorized_networks {
                  + expiration_time = (known after apply)
                  + name            = (known after apply)
                  + value           = (known after apply)
                }

              + psc_config {
                  + allowed_consumer_projects = (known after apply)
                  + psc_enabled               = (known after apply)
                }
            }

          + location_preference {
              + follow_gae_application = (known after apply)
              + secondary_zone         = (known after apply)
              + zone                   = (known after apply)
            }
        }
    }

  # module.cloudsql.google_sql_user.gauser will be created
  + resource "google_sql_user" "gauser" {
      + host                    = "%"
      + id                      = (known after apply)
      + instance                = "ga-terraform"
      + name                    = "gauser"
      + password                = (sensitive value)
      + project                 = "grasys-study"
      + sql_server_user_details = (known after apply)
    }

  # module.cloudsql.random_id.mysql_gauser_password will be created
  + resource "random_id" "mysql_gauser_password" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 12
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform-plan","PRNumber":32,"Program":"tfcmt","SHA1":"07a085e3fe8c37edeb2cde98821a8d896773f63e","Vars":{},"WorkflowName":"terraform plan"} -->